Bayerdevponomarev.RA_Divisions/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf75bcc5-82ee-4bd0-89e1-420b42c99454">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>RA_AdditionalFields_Region</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_Regions</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_SearchTerm</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_TradingPartner</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_TradingPartners</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP_Customer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP_Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодEcom_Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодEcom_Customer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_IDEcom_Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_IDEcom_Customer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>RA_AdditionalFields_СписокГрузополучателей</name>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Bayerdevponomarev.RA_Divisions/src/CommonForms/РеквизитыПечатиРеализации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	RA_AdditionalFields_ИзменитьФорму();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_ИзменитьФорму()
	RA_AdditionalFields_ИзменитьПолеГрузополучателя();
КонецПроцедуры

&НаСервере
Процедура RA_AdditionalFields_ИзменитьПолеГрузополучателя()

	Если Не RA_AdditionalFields_ИспользоватьОтборПоГрузополучателю() Тогда
		Возврат;
	КонецЕсли;

	Элементы.Грузополучатель.УстановитьДействие("НачалоВыбора",
		"RA_AdditionalFields_ПодключаемыйГрузополучательНачалоВыбора");

	Элементы.Грузополучатель.РедактированиеТекста = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура RA_AdditionalFields_ПодключаемыйГрузополучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СписокГрузополучателей = RA_AdditionalFields_ПолучитьСписокЗначенийГрузополучателей(Партнер);
	
	Если НЕ СписокГрузополучателей.Количество() Тогда
		Возврат;
	КонецЕсли;	

	СтандартнаяОбработка = Ложь;

	НастройкиКД = Новый НастройкиКомпоновкиДанных;

	Отбор = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ПравоеЗначение   = СписокГрузополучателей;
	Отбор.Использование    = Истина;
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
   
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);

	//ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораИспользуютсяТолькоПартнерыБезПолнотекстовогоПоиска", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаСервереБезКонтекста
Функция RA_AdditionalFields_ПолучитьСписокЗначенийГрузополучателей(Партнер)

	УстановитьПривилегированныйРежим(Истина);

	СписокЗначенийДляОтбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПартнерыRA_AdditionalFields_СписокГрузополучателей.Грузополучатель КАК Грузополучатель
		|ИЗ
		|	Справочник.Партнеры.RA_AdditionalFields_СписокГрузополучателей КАК ПартнерыRA_AdditionalFields_СписокГрузополучателей
		|ГДЕ
		|	ПартнерыRA_AdditionalFields_СписокГрузополучателей.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыRA_AdditionalFields_СписокГрузополучателей.Грузополучатель";
	
	Запрос.УстановитьПараметр("Ссылка", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокЗначенийДляОтбора.Добавить(ВыборкаДетальныеЗаписи.Грузополучатель);
	КонецЦикла;
		
	Возврат СписокЗначенийДляОтбора;

КонецФункции

&НаСервереБезКонтекста
Функция RA_AdditionalFields_ИспользоватьОтборПоГрузополучателю()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.RA_AdditionalFields_ИспользоватьОтборГрузополучателяПоПартнеру.Получить();

КонецФункции

#КонецОбласти
